import re
import lung_grongi as lg
inp_lung = input('文章を入力してください')

char_list = list(inp_lung)

regex_hira = '[\u3041-\u309F]'
regex_kata = '[\u30A1-\u30FF]'
result_hira =''
result_kata = ''

list_grongi = []


print(char_list)

for i in range(len(char_list)):       
        result_hira = re.match(regex_hira,char_list[i])
        result_kata = re.match(regex_kata,char_list[i])

        if result_hira:
                list_grongi.append(lg.hira[char_list[i]])
        elif result_kata:
                list_grongi.append(lg.kata[char_list[i]])

print(''.join(list_grongi))










kata = {
         'ア' :'ガ', 'イ' :'ギ', 'ウ' :'グ', 'エ' :'ゲ', 'オ' :'ゴ',
         'ゥ': 'u', 'ヴ': 'u',
         'カ' :'バ', 'キ' :'ビ', 'ク' :'ブ', 'ケ' :'べ', 'コ' :'ボ',
         'サ' :'ガ', 'シ' :'ギ', 'ス' :'グ', 'セ' :'ゲ', 'ソ' :'ゴ',
         'タ' :'ダ', 'チ' :'ヂ', 'ツ' :'ヅ', 'テ' :'デ', 'ト' :'ド',
         'ナ' :'バ', 'ニ' :'ビ', 'ヌ' :'ブ', 'ネ' :'べ', 'ノ' :'ボ',
         'ハ' :'ザ', 'ヒ' :'ジ', 'フ' :'ズ', 'ヘ' :'ゼ', 'ホ' :'ゾ',
         'マ' :'ラ', 'ミ' :'リ', 'ム' :'ル', 'メ' :'レ', 'モ' :'ロ',
         'ヤ' :'ジャ', 'ユ' :'ジュ', 'ヨ' :'ジョ',
         'ラ' :'サ', 'リ' :'シ', 'ル' :'ス', 'レ' :'セ', 'ロ' :'ソ',
         'ワ' :'パ', 'ヲ' :'ゾ', 'ン' :'ン', 
         'ガ' :'ガ', 'ギ' :'ギ', 'グ' :'グ', 'ゲ' :'ゲ', 'ゴ' :'ゴ',
         'ザ' :'ザ', 'ジ' :'ジ', 'ズ' :'ズ', 'ゼ' :'ゼ', 'ゾ' :'ゾ',
         'ダ' :'ザ', 'ヂ' :'ジ', 'ヅ' :'ズ', 'デ' :'ゼ', 'ド' :'ゾ',
         'バ' :'ダ', 'ビ' :'ヂ', 'ブ' :'ヅ', 'ベ' :'デ', 'ボ' :'ド',
         'パ' :'マ', 'ピ' :'ミ', 'プ' :'ム', 'ペ' :'メ', 'ポ' :'モ'
        }
hira = {
        'あ' :'ガ', 'い' :'ギ', 'う' :'グ', 'え' :'ゲ', 'お' :'ゴ',
        'ぅ': 'u', 
        'か' :'バ', 'き' :'ビ', 'く' :'ブ', 'け' :'ベ', 'こ' :'ボ',
        'さ' :'ガ', 'し' :'ギ', 'す' :'グ', 'せ' :'ゲ', 'そ' :'ゴ',
        'た' :'ダ', 'ち' :'ヂ', 'つ' :'ヅ', 'て' :'デ', 'と' :'ド',
        'な' :'バ', 'に' :'ビ', 'ぬ' :'ブ', 'ね' :'ベ', 'の' :'ボ',
        'は' :'ザ', 'ひ' :'ジ', 'ふ' :'ズ', 'へ' :'ゼ', 'ほ' :'ゾ',
        'ま' :'ラ', 'み' :'リ', 'む' :'ル', 'め' :'レ', 'も' :'ロ',
        'や' :'ジャ', 'ゆ' :'ジュ', 'よ' :'ジョ',
        'ら' :'サ', 'り' :'シ', 'る' :'ス', 'れ' :'セ', 'ろ' :'ソ',
        'わ' :'パ', 'を' :'ゾ', 'ん' :'ン', 
        'が' :'ガ', 'ぎ' :'ギ', 'ぐ' :'グ', 'げ' :'ゲ', 'ご' :'ゴ',
        'ざ' :'ザ', 'じ' :'ジ', 'ず' :'ズ', 'ぜ' :'ゼ', 'ぞ' :'ゾ',
        'だ' :'ザ', 'ぢ' :'ジ', 'づ' :'ズ', 'で' :'ゼ', 'ど' :'ゾ',
        'ば' :'ダ', 'び' :'ヂ', 'ぶ' :'ヅ', 'べ' :'デ', 'ぼ' :'ド',
        'ぱ' :'マ', 'ぴ' :'ミ', 'ぷ' :'ム', 'ぺ' :'メ', 'ぽ' :'モ'
        }